{"config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "b_constraint": null, "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "name": "convolution2d_1", "nb_filter": 24, "batch_input_shape": [null, 64, 64, 1], "nb_row": 5, "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"axis": 1, "name": "batchnormalization_1", "momentum": 0.99, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null, "mode": 0}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "bias": true, "init": "glorot_uniform", "nb_filter": 36, "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "name": "convolution2d_2", "b_constraint": null, "nb_row": 5, "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "init": "glorot_uniform", "nb_filter": 48, "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "name": "convolution2d_3", "b_constraint": null, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "bias": true, "init": "glorot_uniform", "nb_filter": 64, "trainable": true, "W_regularizer": null, "dim_ordering": "tf", "activation": "linear", "activity_regularizer": null, "name": "convolution2d_4", "b_constraint": null, "nb_row": 3, "border_mode": "same", "subsample": [1, 1], "W_constraint": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": 4096, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activation": "linear", "bias": true, "name": "dense_1", "b_constraint": null, "output_dim": 1164, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": 1164, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activation": "linear", "bias": true, "name": "dense_2", "b_constraint": null, "output_dim": 100, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": 100, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activation": "linear", "bias": true, "name": "dense_3", "b_constraint": null, "output_dim": 50, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": 50, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "activation": "linear", "bias": true, "name": "dense_4", "b_constraint": null, "output_dim": 10, "W_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "init": "glorot_uniform", "input_dim": 10, "W_regularizer": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_5", "b_constraint": null, "output_dim": 1, "W_constraint": null, "b_regularizer": null}}], "keras_version": "1.2.0", "class_name": "Sequential"}